{
  "id": 1,
  "title": "RCCG Newspring Water Baptism Ceremony",
  "date": "May 12, 2025",
  "time": "10:00 AM",
  "location": "RCCG Newspring Church, Lagos",
  "image": "https://registrations-production.s3.amazonaws.com/uploads/event/logo/2727839/medium_image-1684783654839.jpg",
  "description": "Join us for an unforgettable spiritual celebration at the RCCG Newspring Water Baptism Ceremony. This event is a landmark occasion where new believers step forward in obedience to Christ's command, declaring their faith in a public setting. The ceremony begins at 9:30 AM with a time of heartfelt worship led by our praise band, setting a reverent atmosphere as we prepare our hearts for the ordinance.\n\nCandidates will gather briefly for a pre-baptism orientation and prayer at 10:00 AM in the Fellowship Hall. During this time, our pastoral team will share a teaching on the biblical significance of baptism—examining passages from Romans 6, Matthew 28, and Acts 2. Each candidate will then share a short personal testimony of faith, offering a glimpse into the transformative work of God in their lives.\n\nAt 11:00 AM, we will transition to the baptismal pool located at the east wing of the sanctuary. Family and friends are encouraged to assemble in the seating gallery, where an elevated platform provides an unobstructed view of the immersive ritual. Candidates should come prepared with a white baptismal robe, a change of dry clothes, and a towel. For modesty and convenience, robes are available at no extra cost upon request.\n\nImmediately following the immersion, we will join together in a time of celebratory fellowship, featuring light refreshments and opportunities for photographs. Our Media Team will be on hand to capture these precious moments—feel free to gather for group photos against the backdrop of the baptismal pool.\n\nPlease note: Registration is required to participate. You must have completed the New Believers' Foundations course, held weekly on Tuesdays at 5:00 PM, before being eligible for baptism. Registration closes on May 5, 2025, at 11:59 PM. Late registrations will not be accepted.\n\nFor inquiries or to request transportation assistance, contact our Church Office via email at info@newspringchurch.org or call +234 81 2345 6789. We look forward to celebrating this pivotal step of faith with you and rejoice in the new life we have in Christ!",
  "registrationOpen": true,
  "upcomingEvents": [
    {
      "id": 2,
      "title": "RCCG Newspring Youth Service",
      "date": "April 28, 2025",
      "time": "4:00 PM",
      "location": "RCCG Newspring Church, Lagos",
      "image": "https://scontent-los2-1.xx.fbcdn.net/v/t39.30808-6/487395687_1077807247706556_8228073702358969909_n.jpg?_nc_cat=109&ccb=1-7&_nc_sid=f727a1&_nc_eui2=AeEmViL40fQSWSuzpnZwQYkiJEiLTdzxDlMkSItN3PEOU4ZMuZ_r2X2VSzSwC6nUmQnOYWPmDe9eE5Cwv1fzUotM&_nc_ohc=oflhmPkfepoQ7kNvwF9jzkr&_nc_oc=AdmFZux3Lp3wHKfNz8LODLt1i2lWCsv60D0OMyhRSv9FmoxTmIWegohOOecgU94q__Y&_nc_zt=23&_nc_ht=scontent-los2-1.xx&_nc_gid=I6watpICtpspyWwJ_BZPpQ&oh=00_AfHwTF1PTbvc6P-yHfUIcYVfWHMAM5mjQ2m-9JtE7I2HtA&oe=6811DFB8",
      "description": "Join us for an exciting Youth Service filled with praise, worship, and a powerful message for the younger generation. This event will ignite your faith and strengthen your walk with Christ.",
      "registrationOpen": true
    },
    {
      "id": 3,
      "title": "RCCG Newspring Family Fun Day",
      "date": "June 5, 2025",
      "time": "10:00 AM",
      "location": "RCCG Newspring Church Grounds, Lagos",
      "image": "https://scontent-los2-1.xx.fbcdn.net/v/t39.30808-6/492309537_1093615989459015_8919356932961808365_n.jpg?_nc_cat=107&ccb=1-7&_nc_sid=f727a1&_nc_eui2=AeHdt1Y1BazZZ4McFwx3sm-8v0lJM6aNLv2_SUkzpo0u_VdTydvPRd1NxaGXpb99ctGcPeCquL-ulGeiZAWvcSka&_nc_ohc=CZ3yfVPERvcQ7kNvwHWmCag&_nc_oc=AdmyHVKh1vdE_C_5pxB0UP0eRrnUkb8X5Y0fzIsYV5pF4QPsOnEOPc8xUIcgcvuOERs&_nc_zt=23&_nc_ht=scontent-los2-1.xx&_nc_gid=9k6JtJWtIKUJp8UUIyxCEg&oh=00_AfFH3vUPowOpX75berk9u7r-9IVRNkH54Azyef9KX7szWQ&oe=6811CA90",
      "description": "A fun-filled day for the whole family, with games, activities, and entertainment. This is a time to relax, enjoy, and create lasting memories with your loved ones.",
      "registrationOpen": true
    },
    {
      "id": 4,
      "title": "RCCG Newspring Water Baptism Ceremony (Upcoming)",
      "date": "June 15, 2025",
      "time": "10:00 AM",
      "location": "RCCG Newspring Church, Lagos",
      "image": "https://scontent-los2-1.xx.fbcdn.net/v/t39.30808-6/489927183_1093617356125545_8031765886510725651_n.jpg?_nc_cat=107&ccb=1-7&_nc_sid=f727a1&_nc_eui2=AeHkLdGPLQ85LLDAei_JN8a2u1AqQ_TU1-i7UCpD9NTX6F1fPEPG1vBT5bgPTY9aogFbhxmrSTcmcdbWmSoSbSJP&_nc_ohc=YKjNAaR9FOAQ7kNvwF7DUH0&_nc_oc=AdnpoRnRLWWknecZfe_9rH0bUd56q_454yhlRoNPBEaoq_a2s1wHpmDnJ3PxHk5bwz8&_nc_zt=23&_nc_ht=scontent-los2-1.xx&_nc_gid=kb1Wngoa-sO5scaSe51tAA&oh=00_AfHaWNCZgB48wTN92-rjL7LrKcaI4EqGROyg-1bEDqGlCQ&oe=6811E324",
      "description": "The next water baptism ceremony is coming soon! Prepare for another life-changing moment as we celebrate faith and new beginnings. Registration will open soon for those looking to take the step of baptism in obedience to Christ.",
      "registrationOpen": false
    }
  ]
}